In [16]:
import pandas as pd 

# 데이터 불러오기
df = pd.read_csv("type1_data1.csv")

# 1. 중복 데이터 제거

# 2. "f3" 컬럼의 값 변환: 결측치는 0, 'silver'는 1, 'gold'는 2, 'vip'는 3

# 3. 변환된 'f3' 컬럼의 총합을 정수형으로 구하기

In [24]:
# 2. "f3" 컬럼의 값 변환: 결측치는 0, 'silver'는 1, 'gold'는 2, 'vip'는 3

change = {
    "silver" : 1, 
    "gold" : 2, 
    "vip" : 3
}

df["f3"].replace(change,inplace=True)

C:\Users\krcea\AppData\Local\Temp\ipykernel_14816\2599485682.py:9: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df["f3"].replace(change,inplace=True)

In [26]:
df["f3"].fillna(0, inplace=True)
df["f3"]

0      2.0
1      0.0
2      2.0
3      0.0
4      0.0
      ...
115    2.0
116    3.0
117    1.0
118    2.0
119    3.0
Name: f3, Length: 118, dtype: float64

In [28]:
int(df["f3"].sum())

167

In [20]:
print(df.shape)

df.drop_duplicates(inplace=True)

print(df.shape)

(120, 10)
(118, 10)

In [9]:
df.index[df.duplicated()]

Index([100, 101], dtype='int64')

In [10]:
df.iloc[99:102]

        id   age city    f1  f2    f3    f4         f5  subscribed    views
99    id99   1.0   경기  47.0   0  gold  ESFJ  97.381034  2024-12-02   6090.0
100  id100  47.0   경기  53.0   0   vip  ESFP  33.308999  2024-02-21  15535.0
101   id68  35.0   경기  45.0   2  gold  ISFP  67.886373  2024-07-29   8599.0

In [11]:
df.index[df.duplicated(keep=False)]

Index([10, 68, 100, 101], dtype='int64')

In [14]:
df.loc[10:11]

       id   age city    f1  f2    f3    f4         f5  subscribed    views
10  id100  47.0   경기  53.0   0   vip  ESFP  33.308999  2024-02-21  15535.0
11   id11  40.0   서울  68.0   0  gold  ENFP  98.429899  2024-10-29   6752.0

In [15]:
df.loc[67:69]

      id   age city    f1  f2    f3    f4         f5  subscribed   views
67  id67  66.0   경기  52.0   1   NaN  ISFJ  73.586397  2024-06-17  1159.0
68  id68  35.0   경기  45.0   2  gold  ISFP  67.886373  2024-07-29  8599.0
69  id69  75.0   경기  85.0   0   NaN  ESTJ  69.730313  2024-11-14  2708.0